InformationRegisters/ИсторияЛида.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЛида</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПисьмаТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПисьмаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗаписиВМобильномПриложении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияЛида/Ext/ManagerModule.bsl
Процедура ДобавитьЗаписьВИсториюЛида(Лид, Дата, Пользователь, ИДЗаписи, Комментарий, ТекстПисьмаТекст="", ТекстПисьмаHTML="") Экспорт
	
	НаборЗаписей = РегистрыСведений.ИсторияЛида.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Лид.Установить(Лид); 
	НаборЗаписей.Отбор.Дата.Установить(Дата); 
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь); 
	НаборЗаписей.Отбор.ИДЗаписи.Установить(ИДЗаписи); 
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Лид = Лид; 
	НоваяЗапись.Дата = Дата;
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.ИДЗаписи = ИДЗаписи;
	
	НоваяЗапись.Комментарий = Комментарий;
	НоваяЗапись.ТекстПисьмаТекст = ТекстПисьмаТекст;
	НоваяЗапись.ТекстПисьмаHTML = ТекстПисьмаHTML;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
